; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-9)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 0 of 9
2. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 0 of 9
3. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 1 of 9
4. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 1 of 9
5. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 1 of 9
6. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 1 of 9
7. (drop ball8 room4 left)
   deleted: (carry ball8 left)
   added: (at ball8 room4) (free left)
   goals met: 2 of 9
8. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 2 of 9
9. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 2 of 9
10. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 2 of 9
11. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 3 of 9
12. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 3 of 9
13. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 3 of 9
14. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 3 of 9
15. (drop ball6 room4 left)
   deleted: (carry ball6 left)
   added: (at ball6 room4) (free left)
   goals met: 4 of 9
16. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 4 of 9
17. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 4 of 9
18. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 4 of 9
19. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 5 of 9
20. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 5 of 9
21. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 5 of 9
22. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 5 of 9
23. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 6 of 9
24. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 6 of 9
25. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 6 of 9
26. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 9
27. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 7 of 9
28. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 7 of 9
29. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 7 of 9
30. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 7 of 9
31. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 8 of 9
32. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 8 of 9
33. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 8 of 9
34. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 8 of 9
35. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 9 of 9
